### 嵌入式处理器

嵌入式处理器是嵌入式系统的核心，是控制、辅助系统运行的硬件单元。目前常见的嵌入式处理器有：

- 嵌入式微处理器（MPU）
- 嵌入式微控制器（MCU）
- 嵌入式DSP处理器（DSP）
- 嵌入式片上系统（SoC)

ARM架构属于RISC指令集，指令集**精简**、指令**等长**。虽然这样设计可以提高处理效率，当遇到复杂的指令后，就需要更多的简单指令来堆砌复杂任务。面对不断升级的Android系统，单核的ARM芯片已经很难支持其流畅地运行。故此ARM架构的处理器也在不断的提升自我，最终通过多个指令完成复杂的任务操作。

当然其他领域也纷纷开始支持Android系统：

处理器 | 概况
-- | --
ARM | 最早支持，支持的最完善。只要用在手机市场，目前积极进军上网本，智能家居等市场
X86 | 目前支持的比较完善。推出了atom+Android的上网本，卖点在于支持Atom+Android和Atom+Win7双系统
MIPS | 目前在移植、完善过程中。主要目标在智能家电、上网本领域。龙芯也在积极支持Android
POWER PC | 目前在移植，完善过程中

#### ARM微处理器的工作状态

从编程的角度来看，ARM微处理器的工作状态有两种，并且可在两种状态下切换：

- ARM状态 -- 此时处理器执行32位的字对齐的ARM指令
- Thumb状态 -- 此时处理器执行16位的、半字对其的Thumb指令

处理器工作状态的转变并不影响处理器的工作模式和相应寄存器中的内容。ARM指令集和Thumb指令集均有相应的切换处理器状态的命令，可在两种状态下切换。但ARM微处理器在开始执行代码时，应该处于ARM状态。

进入Thumb状态，当操作数寄存器的状态位（位0）为1时，可采用执行BX指令的方法，使微处理器从ARM状态切换到Thumb状态。当处理器处于Thumb状态时发生异常（如IRQ、FIQ、Undef、Abort、SWI等），则异常处理返回时自动切换为Thumb状态。

进入ARM状态，当操作数寄存器的状态位为0时，执行BX指令可使微处理器从Thumb状态切换到ARM状态。在处理异常时，把PC指针放入异常模式链接寄存器中，并从异常向量地址开始执行程序，也可以使处理器切换到ARM状态。

ARM微处理器支持7种运行模式，分别是：

- 用户模式（usr）：ARM处理器正常的程序执行状态
- 快速中断模式（fiq）：用于高速数据传输或通道处理
- 外部中断模式（irq）：用于通用的中断处理
- 管理模式（svc）：操作系统使用的保护模式
- 数据访问终止模式（abt）：当数据或指令预取终止时进入该模式，可用于虚拟存储及存储保护
- 系统模式（sys）：运行具有特权的操作系统任务
- 未定义指令中止模式（und）：当未定义的指令执行时进入该模式，可用于支持硬件协处理器的软件仿真

ARM微处理器的运行模式可以通过软件改变，也可以通过外部中断或异常处理改变。大多数的应用程序运行在用户模式下，当处理器运行在用户模式下时，某些保护的系统资源是不可访问的。

除了用户模式外，其余所有的6种模式成为**特权模式**，其中除去用户模式和系统模式外的5种又称为**异常模式**，常用于处理中断或异常，以及需要访问受保护的系统资源等情况。

#### ARM状态下的寄存器组织

ARM微处理器共有37个32位寄存器，其中31个为通用寄存器，6个为状态寄存器。但是这些寄存器**不能被同时**访问。具体取决于微处理器的工作状态及具体的运行模式。但是在任何时候，**通用寄存器 R14-R0**、**程序计数器PC**以及一个或两个**状态寄存器**都是可访问的。

通用寄存器包括R0-R15，可分3类：

- **未分组寄存器 R0~R7**
	在所有运行的模式下，未分组寄存器都指向同一个物理寄存器，它们未被系统用作特殊的用途，因此在中断或异常处理进行运行模式转换时，由于不同的处理器运行模式均使用相同的物理寄存器，可能会造成寄存器中数据的破坏，这一点在进行程序设计时应当引起注意

- **分组寄存器 R8~R14**
	对于分组寄存器，它们每一次所访问的物理寄存器与处理器当前的运行模式有关。

	对于R8~R12来说，每个寄存器对应两个不同的物理寄存器，当使用fiq（快速中断）模式时，访问寄存器R8_fiq~R12_fiq。当使用除了fiq模式以外的其他模式时，访问寄存器R8_usr~R12_usr

	对R13、R14来说，每个寄存器对应6个不同的物理寄存器，其中的一个是用户模式和系统模式共用。另外5个物理寄存器对应于其他5种不同的运行模式。采用以下记号来区分不同的物理寄存器：
	- R13_<mode>
	- R14_<mode>
	其中，mode为以下几种模式：usr、fiq、irq、svc、abt、und。

	**R13**常用来做**堆栈指针**，当然这字还是习惯用法（但是在Thumb指令集中，某些指令强制性要求使用R13作为堆栈指针）

	由于处理器的每种运行模式均有自己独立的物理寄存器R13，在用于应用程序的初始化部分，一般都要初始化每种模式下的R13，使其只想该运行模式的栈空间，这样当程序的运行进入异常模式时，可以将需要保护的寄存器放入R13所指向的堆栈。而当程序从异常模式返回时，则从相应的堆栈中恢复，采用这种方式可保证异常发生后程序的正常执行。

	**R14**也称作**子程序连接寄存器**或**连接寄存器LR**。当执行BL子程序调用指令时，R14中得到R15（PC）的备份。其他情况下，R14用作通用寄存器。与之类似，当发生异常或中断时，对应的分组寄存器R14_svc、R14_irq、R14_fiq、R14_abt和R14_und用来保存R15的返回值。

- **程序计数器 PC（R15）**
	在ARM状态下，PC的0和1位是0（位[1:0]为0，[31:2]用于保存PC）。在Thumb状态下，PC的0位是0（位[0]为0，位[31:1]用于保存PC）。

。。。















